Infineon/psoc4hal/COMPONENT_PSOC4HAL/source/cyhal_clock.c
/*******************************************************************************
* File Name: cyhal_clock.c
*
* Description:
* Provides an implementation for high level interface for interacting with the
* Cypress Clocks. This is a wrapper around the lower level PDL API.
*
********************************************************************************
* \copyright
* Copyright 2018-2020 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include <stdlib.h>
#include "cy_sysclk.h"
#include "cy_utils.h"
#include "cyhal_clock.h"
#include "cyhal_utils.h"
#include "cyhal_hwmgr.h"

#if defined(__cplusplus)
extern "C"
{
#endif

#define PLL_LOCK_TIME (10000UL)

/******************************************************************************
 ****************************** Clock Resources *******************************
 *****************************************************************************/
const cyhal_resource_inst_t CYHAL_CLOCK_IMO = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_IMO, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_EXT = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_EXT, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_ILO = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_ILO, 0 };
#if defined(CY_IP_M0S8EXCO)
const cyhal_resource_inst_t CYHAL_CLOCK_ECO = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_ECO, 0 };
#endif
#if defined(CY_IP_M0S8WCO)
const cyhal_resource_inst_t CYHAL_CLOCK_WCO = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_WCO, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_WDCSEL = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_WDCSEL, 0 };
#endif

#if (EXCO_PLL_PRESENT > 0)
const cyhal_resource_inst_t CYHAL_CLOCK_PLL = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_PLL, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_PLLSEL = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_PLLSEL, 0 };
#endif

const cyhal_resource_inst_t CYHAL_CLOCK_LF = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_LF, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_HF = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_HF, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_PUMP = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_PUMP, 0 };
const cyhal_resource_inst_t CYHAL_CLOCK_SYS = { CYHAL_RSC_CLOCK, (uint8_t)CYHAL_CLOCK_BLOCK_SYS, 0 };

/******************************************************************************
 ***************************** Support Functions*******************************
 *****************************************************************************/
static void setup_clock_inst(cyhal_clock_t *clock, const cyhal_resource_inst_t* resource, bool reserved)
{
    clock->block = (cyhal_clock_block_t)resource->block_num;
    clock->channel = resource->channel_num;
    clock->reserved = reserved;
}

static cy_rslt_t compute_div(uint32_t input_hz, uint32_t desired_hz, uint32_t divider_bits, const cyhal_clock_tolerance_t *tolerance, uint32_t *div)
{
    uint32_t max_div = (1 << divider_bits);
    *div = (input_hz + (desired_hz / 2)) / desired_hz;
    if (*div > max_div)
        *div = max_div;

    uint32_t diff = (tolerance != NULL)
                    ? (uint32_t)abs(_cyhal_utils_calculate_tolerance(tolerance->type, desired_hz, input_hz / *div))
                    : 0;
    return (tolerance != NULL && diff > tolerance->value)
        ? CYHAL_CLOCK_RSLT_ERR_FREQ
        : CY_RSLT_SUCCESS;
}

static uint32_t get_channel_count(cyhal_clock_block_t block)
{
    switch (block)
    {
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
            return PERI_PCLK_DIV_8_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
            return PERI_PCLK_DIV_16_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
            return PERI_PCLK_DIV_16_5_NR;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return PERI_PCLK_DIV_24_5_NR;
        default:
            return 1;
    }
}

static void cyhal_update_system_state(bool before_change, uint32_t old_hfclk_freq_hz, uint32_t new_hfclk_freq_hz)
{
    // If increasing the clock frequency we need to update the speeds
    // before the change. If decreasing the frequency we need to update
    // after the change.
    if ((before_change == (bool)(new_hfclk_freq_hz > old_hfclk_freq_hz)) ||
        (!before_change == (new_hfclk_freq_hz < old_hfclk_freq_hz)))
    {
        Cy_SysLib_SetWaitStates(new_hfclk_freq_hz / 1000000);
    }

    // If after the change, update the clock
    if (!before_change)
        SystemCoreClockUpdate();
}

static uint32_t cyhal_get_path_freq(cy_en_sysclk_clkhf_src_t clk)
{
    switch (clk)
    {
        case CY_SYSCLK_CLKHF_IN_IMO:
            return Cy_SysClk_ImoGetFrequency();
        case CY_SYSCLK_CLKHF_IN_EXT:
            return Cy_SysClk_ExtClkGetFrequency();
#if defined(CY_IP_M0S8EXCO)
        case CY_SYSCLK_CLKHF_IN_ECO:
            return Cy_SysClk_EcoGetFrequency();
#endif
#if (EXCO_PLL_PRESENT > 0)
        case CY_SYSCLK_CLKHF_IN_PLL:
            return Cy_SysClk_PllGetFrequency(0);
#endif
        default:
            return CYHAL_CLOCK_RSLT_ERR_FREQ;
    }
}

static cy_rslt_t cyhal_get_sysclk_div(uint32_t div_val, cy_en_sysclk_dividers_t *div)
{
    switch (div_val)
    {
        case 1:
            *div = CY_SYSCLK_NO_DIV;
            break;
        case 2:
            *div = CY_SYSCLK_DIV_2;
            break;
        case 4:
            *div = CY_SYSCLK_DIV_4;
            break;
        case 8:
            *div = CY_SYSCLK_DIV_8;
            break;
        default:
            return CYHAL_CLOCK_RSLT_ERR_FREQ;
    }
    return CY_RSLT_SUCCESS;
}

static inline cy_rslt_t cyhal_set_hfclk_div(uint32_t div_val)
{
    cy_en_sysclk_dividers_t new_div;
    cy_rslt_t rslt = cyhal_get_sysclk_div(div_val, &new_div);

    if (CY_RSLT_SUCCESS == rslt)
    {
        uint32_t old_div = (uint32_t)Cy_SysClk_ClkHfGetDivider();
        cy_en_sysclk_clkhf_src_t src = Cy_SysClk_ClkHfGetSource();
        uint32_t path_freq = cyhal_get_path_freq(src);
        uint32_t old_freq = path_freq >> old_div;
        uint32_t new_freq = path_freq >> ((uint32_t)new_div);

        cyhal_update_system_state(true, old_freq, new_freq);
        Cy_SysClk_ClkHfSetDivider(new_div);
        cyhal_update_system_state(false, old_freq, new_freq);
    }

    return rslt;
}

static inline cy_rslt_t cyhal_set_hfclk_source(cyhal_clock_block_t block)
{
    cy_en_sysclk_clkhf_src_t new_src;
    switch (block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
            new_src = CY_SYSCLK_CLKHF_IN_IMO;
            break;
        case CYHAL_CLOCK_BLOCK_EXT:
            new_src = CY_SYSCLK_CLKHF_IN_EXT;
            break;
#if defined(CY_IP_M0S8EXCO)
        case CYHAL_CLOCK_BLOCK_ECO:
            new_src = CY_SYSCLK_CLKHF_IN_ECO;
            break;
#endif
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            new_src = CY_SYSCLK_CLKHF_IN_PLL;
            break;
#endif
        default:
            return CYHAL_CLOCK_RSLT_ERR_SOURCE;
    }

    /* Only used if updating HFClk 0 */
    uint32_t div = (uint32_t)Cy_SysClk_ClkHfGetDivider();
    cy_en_sysclk_clkhf_src_t old_src = Cy_SysClk_ClkHfGetSource();
    uint32_t old_freq = cyhal_get_path_freq(old_src) >> div;
    uint32_t new_freq = cyhal_get_path_freq(new_src) >> div;

    cyhal_update_system_state(true, old_freq, new_freq);
    Cy_SysClk_ClkHfSetSource(new_src);
    cyhal_update_system_state(false, old_freq, new_freq);

    return CY_RSLT_SUCCESS;
}

#if (EXCO_PLL_PRESENT > 0)
static uint32_t cyhal_get_pll_in_freq()
{
    cy_en_sysclk_pll_src_t src = Cy_SysClk_PllGetSource(0);
    if (src == CY_SYSCLK_PLL_SRC_IMO)
        return Cy_SysClk_ImoGetFrequency();
    else
    {
#if defined(CY_IP_M0S8EXCO)
        return Cy_SysClk_EcoGetFrequency();
#else
        return 0;
#endif
    }
}

static inline cy_rslt_t cyhal_change_pll_enablement(bool enable, bool wait_for_lock)
{
    cy_stc_sysclk_pll_manual_config_t cfg;
    Cy_SysClk_PllGetConfiguration(0, &cfg);

    uint32_t new_freq, old_freq;
    uint32_t div = (uint32_t)Cy_SysClk_ClkHfGetDivider();
    uint32_t src_freq = cyhal_get_pll_in_freq();
    uint32_t pll_freq = CY_SYSLIB_DIV_ROUND((uint64_t)src_freq * (uint64_t)cfg.feedbackDiv, (uint32_t)cfg.referenceDiv * (uint32_t)cfg.outputDiv);
    if (enable)
    {
        new_freq = pll_freq >> div;
        old_freq = src_freq >> div;
    }
    else
    {
        new_freq = src_freq >> div;
        old_freq = pll_freq >> div;
    }

    bool pll_sources_hf = (CY_SYSCLK_CLKHF_IN_PLL == Cy_SysClk_ClkHfGetSource());
    if (pll_sources_hf)
        cyhal_update_system_state(true, old_freq, new_freq);

    cy_rslt_t rslt = CY_RSLT_SUCCESS;
    if (enable)
        rslt = Cy_SysClk_PllEnable(0, wait_for_lock ? PLL_LOCK_TIME : 0UL);
    else
        Cy_SysClk_PllDisable(0);

