Infineon/psoc4hal/COMPONENT_PSOC4HAL/source/cyhal_clock.c
    if (pll_sources_hf)
    {
        if (CY_RSLT_SUCCESS == rslt)
            cyhal_update_system_state(false, old_freq, new_freq);
        else // revert the change if there was one
            cyhal_update_system_state(false, new_freq, old_freq);
    }

    return rslt;
}

static inline cy_rslt_t cyhal_set_pll_freq(uint32_t new_freq)
{
    cy_stc_sysclk_pll_manual_config_t cfg;
    Cy_SysClk_PllGetConfiguration(0, &cfg);

    bool enabled = Cy_SysClk_PllIsEnabled(0);
    if (enabled)
        Cy_SysClk_PllDisable(0);

    uint32_t src_freq = cyhal_get_pll_in_freq();
    uint32_t old_freq = CY_SYSLIB_DIV_ROUND((uint64_t)src_freq * (uint64_t)cfg.feedbackDiv, (uint32_t)cfg.referenceDiv * (uint32_t)cfg.outputDiv);

    uint32_t div = (uint32_t)Cy_SysClk_ClkHfGetDivider();
    uint32_t old_hf_freq = old_freq >> div;
    uint32_t new_hf_freq = new_freq >> div;

    bool pll_sources_hf = (CY_SYSCLK_CLKHF_IN_PLL == Cy_SysClk_ClkHfGetSource());
    if (pll_sources_hf)
        cyhal_update_system_state(true, old_hf_freq, new_hf_freq);

    cy_stc_sysclk_pll_config_t new_cfg =
    {
        .inputFreq = src_freq,
        .outputFreq = new_freq,
    };
    cy_rslt_t rslt = Cy_SysClk_PllConfigure(0, &new_cfg);

    if (enabled)
    {
        cy_rslt_t rslt2 = Cy_SysClk_PllEnable(0, PLL_LOCK_TIME);
        if (CY_RSLT_SUCCESS == rslt)
            rslt = rslt2;
    }

    if (pll_sources_hf)
    {
        if (CY_RSLT_SUCCESS == rslt)
            cyhal_update_system_state(false, old_hf_freq, new_hf_freq);
        else // revert the change if there was one
            cyhal_update_system_state(false, new_hf_freq, old_hf_freq);
    }

    return rslt;
}
#endif

/******************************************************************************
 **************************** Public API (clocks) *****************************
 *****************************************************************************/
cy_rslt_t cyhal_clock_get(cyhal_clock_t *clock, const cyhal_resource_inst_t *resource)
{
    CY_ASSERT(NULL != clock);
    CY_ASSERT(NULL != resource);
    CY_ASSERT(CYHAL_RSC_CLOCK == resource->type);

    setup_clock_inst(clock, resource, false);

    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_clock_allocate(cyhal_clock_t *clock, cyhal_clock_block_t block)
{
    CY_ASSERT(NULL != clock);

    uint8_t maxChannels = (uint8_t)get_channel_count(block);
    for (uint8_t i = 0; i < maxChannels; i++)
    {
        cyhal_resource_inst_t clock_resource = { CYHAL_RSC_CLOCK, block, i };
        if (CY_RSLT_SUCCESS == cyhal_hwmgr_reserve(&clock_resource))
        {
            setup_clock_inst(clock, &clock_resource, true);
            return CY_RSLT_SUCCESS;
        }
    }
    return CYHAL_HWMGR_RSLT_ERR_NONE_FREE;
}

cy_rslt_t cyhal_clock_init(cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    cyhal_resource_inst_t resource = { CYHAL_RSC_CLOCK, clock->block, clock->channel };
    cy_rslt_t rslt = cyhal_hwmgr_reserve(&resource);
    if (CY_RSLT_SUCCESS == rslt)
    {
        clock->reserved = true;
    }

    return rslt;
}

cyhal_clock_feature_t cyhal_clock_get_features(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_LF:
            return CYHAL_CLOCK_FEATURE_NONE;

        case CYHAL_CLOCK_BLOCK_IMO:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_FREQUENCY);

#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WDCSEL:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_SOURCE);
        case CYHAL_CLOCK_BLOCK_WCO:
#endif
#if defined(CY_IP_M0S8EXCO)
        case CYHAL_CLOCK_BLOCK_ECO: //We don't allow setting frequency because we don't have the necessary args
#endif
        case CYHAL_CLOCK_BLOCK_ILO:
            return CYHAL_CLOCK_FEATURE_ENABLE;

        case CYHAL_CLOCK_BLOCK_EXT:
            return CYHAL_CLOCK_FEATURE_FREQUENCY;

#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_FREQUENCY);
        case CYHAL_CLOCK_BLOCK_PLLSEL:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_SOURCE);
#endif

        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_DIVIDER | CYHAL_CLOCK_FEATURE_FREQUENCY);

        case CYHAL_CLOCK_BLOCK_HF:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_SOURCE | CYHAL_CLOCK_FEATURE_DIVIDER);
        case CYHAL_CLOCK_BLOCK_PUMP:
            return (cyhal_clock_feature_t)(CYHAL_CLOCK_FEATURE_ENABLE | CYHAL_CLOCK_FEATURE_SOURCE);
        case CYHAL_CLOCK_BLOCK_SYS:
            return CYHAL_CLOCK_FEATURE_DIVIDER;

        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_FEATURE_NONE;
    }
}

bool cyhal_clock_is_enabled(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
            return Cy_SysClk_ImoIsEnabled();
        case CYHAL_CLOCK_BLOCK_EXT:
            return (Cy_SysClk_ExtClkGetFrequency() > 0);
        case CYHAL_CLOCK_BLOCK_ILO:
            return Cy_SysClk_IloIsEnabled();
#if defined(CY_IP_M0S8EXCO)
        case CYHAL_CLOCK_BLOCK_ECO:
            return Cy_SysClk_EcoIsEnabled();
#endif
#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WCO:
            return Cy_SysClk_WcoIsEnabled();
#endif
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return Cy_SysClk_PllIsEnabled(clock->channel + 1);
#endif

        case CYHAL_CLOCK_BLOCK_PUMP:
            return (CY_SYSCLK_PUMP_IN_GND != Cy_SysClk_ClkPumpGetSource());
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return Cy_SysClk_PeriphDividerIsEnabled((cy_en_divider_types_t)clock->block, clock->channel);
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLLSEL:
#endif
#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WDCSEL:
#endif
        case CYHAL_CLOCK_BLOCK_LF:
        case CYHAL_CLOCK_BLOCK_HF:
        case CYHAL_CLOCK_BLOCK_SYS:
            return true;
        default:
            CY_ASSERT(false); //Unhandled clock
            return false;
    }
}

