Infineon/psoc4hal/COMPONENT_PSOC4HAL/source/cyhal_clock.c
cy_rslt_t cyhal_clock_set_enabled(cyhal_clock_t *clock, bool enabled, bool wait_for_lock)
{
    CY_ASSERT(NULL != clock);

    /* Timeout values are from the device datasheet. */

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
            if (enabled)
                Cy_SysClk_ImoEnable();
            else
                Cy_SysClk_ImoDisable();
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_ILO:
            if (enabled)
                Cy_SysClk_IloEnable();
            else
                Cy_SysClk_IloDisable();
            return CY_RSLT_SUCCESS;
#if defined(CY_IP_M0S8EXCO)
        case CYHAL_CLOCK_BLOCK_ECO:
            if (enabled)
            {
                if (Cy_SysClk_EcoIsEnabled())
                {
                    // Already enabled
                    if (wait_for_lock)
                    {
                        for (int t = 0; t < 3 && Cy_SysClk_EcoGetStatus() != CY_SYSCLK_ECO_STABLE; ++t)
                        {
                            Cy_SysLib_DelayUs(1000UL);
                        }
                        return (Cy_SysClk_EcoGetStatus() == CY_SYSCLK_ECO_STABLE)
                            ? CY_RSLT_SUCCESS
                            : CY_SYSCLK_TIMEOUT;
                    }
                    return CY_RSLT_SUCCESS;
                }
                else
                {
                    return Cy_SysClk_EcoEnable(wait_for_lock ? 3000UL : 0UL);
                }
            }
            else
            {
                Cy_SysClk_EcoDisable();
                return CY_RSLT_SUCCESS;
            }
#endif
#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WCO:
            if (enabled)
            {
                Cy_SysClk_WcoEnable(wait_for_lock ? CY_SYSCLK_WCO_TIMEOUT_US : 0UL);
                // Ignore CY_SYSCLK_TIMEOUT unless wait_for_lock is true
                return (wait_for_lock && !Cy_SysClk_WcoIsEnabled())
                    ? CYHAL_CLOCK_RSLT_ERR_LOCK
                    : CY_RSLT_SUCCESS;
            }
            else
            {
                Cy_SysClk_WcoDisable();
                return CY_RSLT_SUCCESS;
            }
#endif
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return cyhal_change_pll_enablement(enabled, wait_for_lock);
#endif
        case CYHAL_CLOCK_BLOCK_PUMP:
            if (enabled)
                Cy_SysClk_ClkPumpSetSource(CY_SYSCLK_PUMP_IN_HFCLK);
            else
                Cy_SysClk_ClkPumpSetSource(CY_SYSCLK_PUMP_IN_GND);
            return CY_RSLT_SUCCESS;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return (enabled)
                ? Cy_SysClk_PeriphEnableDivider((cy_en_divider_types_t)clock->block, clock->channel)
                : Cy_SysClk_PeriphDisableDivider((cy_en_divider_types_t)clock->block, clock->channel);
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_RESOURCE;
    }
}

uint32_t cyhal_clock_get_frequency(const cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    if (!cyhal_clock_is_enabled(clock))
    {
        return 0;
    }

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
            return Cy_SysClk_ImoGetFrequency();
        case CYHAL_CLOCK_BLOCK_EXT:
            return Cy_SysClk_ExtClkGetFrequency();
        case CYHAL_CLOCK_BLOCK_LF:
        case CYHAL_CLOCK_BLOCK_ILO:
            return CY_SYSCLK_ILO_FREQ;
#if defined(CY_IP_M0S8EXCO)
        case CYHAL_CLOCK_BLOCK_ECO:
            return Cy_SysClk_EcoGetFrequency();
#endif
#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WCO:
            return CY_SYSCLK_WCO_FREQ;
        case CYHAL_CLOCK_BLOCK_WDCSEL:
            return 0; // Not yet implemented by PDL
#endif
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return Cy_SysClk_PllIsEnabled(0)
                ? Cy_SysClk_PllGetFrequency(0)
                : 0;
        case CYHAL_CLOCK_BLOCK_PLLSEL:
            return cyhal_get_pll_in_freq();
#endif
        case CYHAL_CLOCK_BLOCK_HF:
            return Cy_SysClk_ClkHfGetFrequency();
        case CYHAL_CLOCK_BLOCK_SYS:
            return Cy_SysClk_ClkSysGetFrequency();
        case CYHAL_CLOCK_BLOCK_PUMP:
            switch (Cy_SysClk_ClkPumpGetSource())
            {
                case CY_SYSCLK_PUMP_IN_IMO:
                    return Cy_SysClk_ImoGetFrequency();
                case CY_SYSCLK_PUMP_IN_HFCLK:
                    return Cy_SysClk_ClkHfGetFrequency();
                case CY_SYSCLK_PUMP_IN_GND:
                default:
                    return 0;
            }
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return Cy_SysClk_PeriphGetFrequency((cy_en_sysclk_divider_types_t)clock->block, clock->channel);
        default:
            CY_ASSERT(false); //Unhandled clock
            return 0;
    }
}

cy_rslt_t cyhal_clock_set_frequency(cyhal_clock_t *clock, uint32_t hz, const cyhal_clock_tolerance_t *tolerance)
{
    CY_ASSERT(NULL != clock);

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
        {
            if (hz < CY_SYSCLK_IMO_24MHZ || hz > CY_SYSCLK_IMO_48MHZ || ((hz % 4000000) != 0))
                return CYHAL_CLOCK_RSLT_ERR_FREQ;

            uint32_t hf_freq = Cy_SysClk_ClkHfGetFrequency();
            uint32_t div = 1 << (uint8_t)Cy_SysClk_ClkHfGetDivider();
            if (Cy_SysClk_ClkHfGetSource() == CY_SYSCLK_CLKHF_IN_IMO)
            	cyhal_update_system_state(true, hf_freq, hz / div);
            Cy_SysClk_ImoSetFrequency((cy_en_sysclk_imo_freq_t)hz);
            if (Cy_SysClk_ClkHfGetSource() == CY_SYSCLK_CLKHF_IN_IMO)
            	cyhal_update_system_state(false, hf_freq, hz / div);
            return CY_RSLT_SUCCESS;
        }
        case CYHAL_CLOCK_BLOCK_EXT:
            Cy_SysClk_ExtClkSetFrequency(hz);
            return CY_RSLT_SUCCESS;
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLL:
            return cyhal_set_pll_freq(hz);
#endif
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        {
            uint32_t div;
            uint32_t input_hz = Cy_SysClk_ClkSysGetFrequency();
            uint32_t bits = (clock->block == CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT) ? 8 : 16;
            cy_rslt_t rslt = compute_div(input_hz, hz, bits, tolerance, &div);
            return (CY_RSLT_SUCCESS == rslt)
                ? Cy_SysClk_PeriphSetDivider((cy_en_sysclk_divider_types_t)clock->block, clock->channel, (div - 1))
                : rslt;
        }
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
        {
            uint32_t div;
            uint32_t input_hz = Cy_SysClk_ClkSysGetFrequency();
            // Multiply input by 32 so we can treat the 5 fractional bits as though they are extentions of the integer divider
            // Leave the the desired frequency alone, so we can just strip out the integer & fractional bits at the end.
            uint32_t bits = (clock->block == CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT) ? 21 : 29; // Integer bits + 5
            cy_rslt_t rslt = compute_div(input_hz << 5, hz, bits, tolerance, &div);
            if (CY_RSLT_SUCCESS == rslt)
            {
                uint32_t div_int = (div >> 5) - 1;
                uint32_t div_frac = div & 0x1F;
                return Cy_SysClk_PeriphSetFracDivider((cy_en_sysclk_divider_types_t)clock->block, clock->channel, div_int, div_frac);
            }
            else
                return rslt;
        }
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    }
}

