Infineon/psoc4hal/COMPONENT_PSOC4HAL/source/cyhal_clock.c
cy_rslt_t cyhal_clock_set_divider(cyhal_clock_t *clock, uint32_t divider)
{
    CY_ASSERT(NULL != clock);

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_HF:
            return cyhal_set_hfclk_div(divider);
        case CYHAL_CLOCK_BLOCK_SYS:
        {
            cy_en_sysclk_dividers_t new_div;
            cy_rslt_t rslt = cyhal_get_sysclk_div(divider, &new_div);
            Cy_SysClk_ClkSysSetDivider(new_div);
            return rslt;
        }
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
            return Cy_SysClk_PeriphSetDivider((cy_en_sysclk_divider_types_t)clock->block, clock->channel, divider - 1);
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            return Cy_SysClk_PeriphSetFracDivider((cy_en_sysclk_divider_types_t)clock->block, clock->channel, divider - 1, 0);
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    }
}

cy_rslt_t cyhal_clock_get_sources(const cyhal_clock_t *clock, const cyhal_resource_inst_t **sources[], uint32_t *count)
{
    #if defined(CY_IP_M0S8WCO)
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_WDCSEL[] =
    {
        &CYHAL_CLOCK_ILO,
        &CYHAL_CLOCK_WCO,
    };
    #endif
    #if (EXCO_PLL_PRESENT > 0)
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_PLLSEL[] =
    {
        &CYHAL_CLOCK_IMO,
        &CYHAL_CLOCK_ECO,
    };
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_PLL[] =
    {
        &CYHAL_CLOCK_PLLSEL,
    };
    #endif
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_LF[] =
    {
        &CYHAL_CLOCK_ILO,
    };
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_HF[] =
    {
        &CYHAL_CLOCK_IMO,
        &CYHAL_CLOCK_EXT,
    #if (EXCO_PLL_PRESENT > 0)
        &CYHAL_CLOCK_PLLSEL,
        &CYHAL_CLOCK_PLL,
    #elif defined(CY_IP_M0S8EXCO)
        &CYHAL_CLOCK_ECO,
    #endif
    };
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_PUMP[] =
    {
        &CYHAL_CLOCK_IMO,
        &CYHAL_CLOCK_HF,
    };
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_SYS[] =
    {
        &CYHAL_CLOCK_HF,
    };
    const cyhal_resource_inst_t *CYHAL_CLOCK_SOURCE_PERIPHERAL[] =
    {
        &CYHAL_CLOCK_SYS,
    };

    CY_ASSERT(NULL != clock);

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_IMO:
        case CYHAL_CLOCK_BLOCK_EXT:
        case CYHAL_CLOCK_BLOCK_ILO:
#if defined(CY_IP_M0S8EXCO)
        case CYHAL_CLOCK_BLOCK_ECO:
#endif
#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WCO:
            *count = 0;
            break;
        case CYHAL_CLOCK_BLOCK_WDCSEL:
            *sources = CYHAL_CLOCK_SOURCE_WDCSEL;
            *count = sizeof(CYHAL_CLOCK_SOURCE_WDCSEL) / sizeof(CYHAL_CLOCK_SOURCE_WDCSEL[0]);
            break;
#endif
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLLSEL:
            *sources = CYHAL_CLOCK_SOURCE_PLLSEL;
            *count = sizeof(CYHAL_CLOCK_SOURCE_PLLSEL) / sizeof(CYHAL_CLOCK_SOURCE_PLLSEL[0]);
            break;
        case CYHAL_CLOCK_BLOCK_PLL:
            *sources = CYHAL_CLOCK_SOURCE_PLL;
            *count = sizeof(CYHAL_CLOCK_SOURCE_PLL) / sizeof(CYHAL_CLOCK_SOURCE_PLL[0]);
            break;
#endif
        case CYHAL_CLOCK_BLOCK_LF:
            *sources = CYHAL_CLOCK_SOURCE_LF;
            *count = sizeof(CYHAL_CLOCK_SOURCE_LF) / sizeof(CYHAL_CLOCK_SOURCE_LF[0]);
            break;
        case CYHAL_CLOCK_BLOCK_HF:
            *sources = CYHAL_CLOCK_SOURCE_HF;
            *count = sizeof(CYHAL_CLOCK_SOURCE_HF) / sizeof(CYHAL_CLOCK_SOURCE_HF[0]);
            break;
        case CYHAL_CLOCK_BLOCK_PUMP:
            *sources = CYHAL_CLOCK_SOURCE_PUMP;
            *count = sizeof(CYHAL_CLOCK_SOURCE_PUMP) / sizeof(CYHAL_CLOCK_SOURCE_PUMP[0]);
            break;
        case CYHAL_CLOCK_BLOCK_SYS:
            *sources = CYHAL_CLOCK_SOURCE_SYS;
            *count = sizeof(CYHAL_CLOCK_SOURCE_SYS) / sizeof(CYHAL_CLOCK_SOURCE_SYS[0]);
            break;
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_8BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_16_5BIT:
        case CYHAL_CLOCK_BLOCK_PERIPHERAL_24_5BIT:
            *sources = CYHAL_CLOCK_SOURCE_PERIPHERAL;
            *count = sizeof(CYHAL_CLOCK_SOURCE_PERIPHERAL) / sizeof(CYHAL_CLOCK_SOURCE_PERIPHERAL[0]);
            break;
        default:
            CY_ASSERT(false); //Unhandled clock
            *count = 0;
            return CYHAL_CLOCK_RSLT_ERR_RESOURCE;
    }
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_clock_set_source(cyhal_clock_t *clock, const cyhal_clock_t *source)
{
    CY_ASSERT(NULL != clock && NULL != source);

    switch (clock->block)
    {
        case CYHAL_CLOCK_BLOCK_HF:
            return cyhal_set_hfclk_source(source->block);
        case CYHAL_CLOCK_BLOCK_PUMP:
            if (source->block == CYHAL_CLOCK_BLOCK_IMO)
            {
                Cy_SysClk_ClkPumpSetSource(CY_SYSCLK_PUMP_IN_IMO);
                return CY_RSLT_SUCCESS;
            }
            else if (source->block == CYHAL_CLOCK_BLOCK_HF)
            {
                Cy_SysClk_ClkPumpSetSource(CY_SYSCLK_PUMP_IN_HFCLK);
                return CY_RSLT_SUCCESS;
            }
            else
                return CYHAL_CLOCK_RSLT_ERR_SOURCE;
#if (EXCO_PLL_PRESENT > 0)
        case CYHAL_CLOCK_BLOCK_PLLSEL:
            if (source->block == CYHAL_CLOCK_BLOCK_IMO)
            {
                Cy_SysClk_PllSetSource(0, CY_SYSCLK_PLL_SRC_IMO);
                return CY_RSLT_SUCCESS;
            }
            else if (source->block == CYHAL_CLOCK_BLOCK_ECO)
            {
                Cy_SysClk_PllSetSource(0, CY_SYSCLK_PLL_SRC_ECO);
                return CY_RSLT_SUCCESS;
            }
            else
                return CYHAL_CLOCK_RSLT_ERR_SOURCE;
#endif
#if defined(CY_IP_M0S8WCO)
        case CYHAL_CLOCK_BLOCK_WDCSEL:
            // Not yet implemented in PDL
#endif
        default:
            CY_ASSERT(false); //Unhandled clock
            return CYHAL_CLOCK_RSLT_ERR_NOT_SUPPORTED;
    }
}

void cyhal_clock_free(cyhal_clock_t *clock)
{
    CY_ASSERT(NULL != clock);

    cyhal_resource_inst_t rsc = { CYHAL_RSC_CLOCK, clock->block, clock->channel };
    cyhal_hwmgr_free(&rsc);
    clock->reserved = false;
}

#if defined(__cplusplus)
}
#endif
